[
	{
		"id": 1,
		"title": "05/22/18",
		"body": "<p>0854\n<br />Drinking my coffee, hanging out with the pups and finishing the last couple things before I jump in the shower and hit the road. Tow company is coming tomorrow to take my Jeep for the Make a Wish foundation. Had some good adventures in that thing. Hope it’ll bring a little help to the foundation.</p>\n\n<p>Heading to La Pine/Deschutes area for camping tonight. Should be an easy 220 mile trek with good weather and decent camping options. Still undecided for tomorrow night. So many options around the Shasta area. Need to figure out my non-I5 route through northern Cali. The adventure begins :)</p>\n\n<p>1708\n<br />Camp is setup. Made it to my target, Fall River CG. Have the entire place to myself. Right next to the lazy river. Little bit of occasional road noise, but not bad. Figure it’ll quiet down later.</p>\n\n<p>Running into La Pine now to get supplies. Firewood, water, dinner, and whiskey.</p>\n\n<p>2136\n<br />Tired as hell. Didn’t eat enough this morning and felt it. Scarfed down a small pizza at Ponderosa Pizza north of La Pine for dinner (saved a slice for breakfast). Town has some rough edges, but decent vibes. Lots of Harleys and Gold Wings out. Only saw one KLR, on the back roads.</p>\n\n<p>Was able to scavenge wood for a decent fire. Must have cleared some trees at the campground, leaving a bunch of downed scraps. Broke down pretty easily. Those Vaseline cotton balls are as good as advertised. Popped two inside a teepee formation with a little base and had a strong fire in five minutes.</p>\n\n<p>Heading into Cali tomorrow. Have a few potential camp spots targeted east of Mount Shasta, but am going to stop in Klamath Falls to get some WiFi, lunch, and a better look.</p>\n\n<p>Felt a huge difference riding when my blood sugar and hydration levels were up. Need to keep on that. Bought a gallon of water for my hydration pack. And will be eating a good breakfast of leftover pizza, granola bars, and coffee.</p>\n\n<p>Stoked to hear everyone is loving the map/site I built. Have a couple ideas for improvements I’m going to work on during my motel stay this weekend. Better segment days and include these journal entries somehow.</p>\n\n<p>Fire is about dead and my sleeping bag sounds better than ever. Will keep chasing the road in the morning ✌🏻\n</p>",
		"created_at": "2018-05-25 17:21:30.726428",
		"updated_at": "2018-05-25 17:21:30.726428",
		"date": "2018-05-22"
	},
	{
		"id": 2,
		"title": "05/23/18",
		"body": "<p>1339\n<br />Made it to Klamath Falls. Rewarding myself with a cheeseburger. Ran into a little wind and some thunderstorms coming into town. Gear and bike held up alright. Brain and body definitely needed a break.</p>\n\n<p>Jumping back on Hwy 97, due south after I scarf this food down.</p>\n\n<p>1728\n<br />Made it to McBride Springs CG. Sites are a tad close, and there is some light road noise, but it’s only 10 minutes from town. And I have my own view of Mt Shasta 😍</p>\n\n<p>2026\n<br />Fire is up and going. Made some deer friends earlier at my campsite. Had to pay damn $8.50 for a shit bundle of wood from Ace Hardware. But at least I got some. Got there at 5:59pm, they close at 6pm 😬. I should have just foraged. But too tired and thought I deserved a California treat.</p>\n\n<p>Top Ramen and cheese-its for dinner. Snickers for desert. Trying to take this “bear country” thing seriously. Cleaned out all my cookware away from my site and will be storing it in my panniers. Can’t imagine one would stroll into a 15 site campsite right off a somewhat main road, but ya never know.</p>\n\n<p>Also screwed up and didn’t realize they had pump water at the CG. Went and spent $1 on a 2L bottle 🤦🏻‍♂️. Need to make a checklist for when I’m tired as hell and can’t think of anything other than keeping my bike upright and moving forward.</p>\n\n<p>Looking forward to sleeping in a bit tomorrow. Going to do a light hike after coffee and then head into town to figure out how to avoid the Memorial Day cluster.\n</p>",
		"created_at": "2018-05-25 17:21:44.908634",
		"updated_at": "2018-05-25 17:21:44.908634",
		"date": "2018-05-23"
	},
	{
		"id": 3,
		"title": "05/24/18",
		"body": "<p>0855\n<br />Beautiful morning. Can finally start to see Mount Shasta a bit better. Instead of a hike today, the plan is to run down to Susanville and crash in a motel tonight. Tomorrow’s storm looks like the real deal, with an inch predicted everyone around here. Figure I’ll get a shower, relax tomorrow morning and hopefully make a run for a campsite after lunch. If it’s not pouring sideways 😕.</p>\n\n<p>Worst case scenario, I stay two nights in Susanville (only $65/night) and hit the road hard on Saturday morning. Not the end of the world, especially with the holiday weekend traffic/crazies coming out. Might as well bunker down a bit versus fighting people for decent campsites.</p>\n\n<p>1313\n<br />At Burney Falls, some memorial state park. Pretty par for the course, except the waterfalls are the real deal. You’re able to walk right down damn near under em. And today there was only a handful of other people. If I didn’t have to ride another 90 minutes I would have jumped in. The 1.5 miles loop back trail was pretty decent too.</p>\n\n<p>Just had a sandwich from the general store here. Decent people, but somehow didn’t know how to make a damn sandwich haha. $9 on top of that. Skipped the Clif bars, they wanted $3.75 for one! Thankfully Red Bull was normal price. Need that caffeine to push me into Susanville.</p>\n\n<p>Hoping the wind isn’t too crazy getting out of here. Not fun stuck behind a semi going 65 with side gusts for an hour straight. Survive and advance.</p>\n\n<p>2003\n<br />Lassen Ale Works might have the best fish and chips I’ve ever had. And their fried pickles are no joke. Was surprised to find it almost full on a Thursday night.</p>\n\n<p>Motel is perfect for $65/night. Got my bike under the awning, AC pumping, and good hot shower pressure. Glad I made the call to push through to Susanville.</p>\n\n<p>Likely be going to sleep early and sleeping in. They have good dark curtains and a decent bed. No clue what tomorrow holds. Will figure it out in the morning ✌🏻\n</p>",
		"created_at": "2018-05-25 17:22:01.48633",
		"updated_at": "2018-05-25 17:22:01.48633",
		"date": "2018-05-24"
	},
	{
		"id": 4,
		"title": "05/25/18",
		"body": "<p>1031\n<br />Pouring rain all night and morning. Flood alerts for the area 😔. Supposed to calm down around noon in Susanville and south of here.</p>\n\n<p>Plan is now to run down to Walker, CA and jump in another motel for the night. Not super stoked, but with the incoming holiday traffic and this heavy rain, I figure a 150 mile day is good enough.</p>\n\n<p>Hopefully all my waterproof stuff is actually waterproof 😁.</p>\n\n<p>1934\n<br />Made it to Walker in one piece. The wind was cooking all down 395 and into Reno. Tried jumping on 580, but got one wind blast with 4 lanes of traffic going 85mph and was off the next exit. Meandered my way south the long way, ultimately getting back on 395, fighting wind the whole way.</p>\n\n<p>Dinner at Mountain View BBQ here in Walker was legit. BBQ brisket sandwich with pickles and grilled onions. This little highway town has some charm to it. Couple cool vintage-y motels and multiple weird flea market/random shit shops. Like a wide variety of metal dinosaur sculptures.</p>\n\n<p>Met a friendly Aussie (aren’t they all?), Gino, at Hallelujah Junction up 395 before Reno. Was riding a pretty Africa Twin, all loaded up, headed north. Showed me recent pictures of his runs across Sonora and Tioga passes, and his work in progress Butler map. I told him not to split too many lanes up in Oregon or Washington. He’s headed to meet his wife in Seattle and then running up to Alaska. Might have to do that next year.</p>\n\n<p>Going to drink my two Coors Lights I paid way too much for on this comfy bed and watch some sports. Either going to run Sonora or Tioga pass tomorrow and try to score an easy campground. Think it’s about time for a real rest day 😬\n</p>",
		"created_at": "2018-05-26 03:03:52.117331",
		"updated_at": "2018-05-26 03:03:52.117331",
		"date": "2018-05-25"
	},
	{
		"id": 5,
		"title": "05/26/18",
		"body": "<p>0926\n<br />Best sleep I’ve had yet. Bed was super comfy. Woke up and decided to make a quick run to a campsite 30 mins south of here. Figure I should try and snag something early today, then go explore. Don’t want to get stuck on Sonora Pass with no camping options and have to run into town somewhere.</p>\n\n<p>Grabbing some gas and then heading out. Crossing my fingers I’ll find a decent spot. Just gotta ride out the weekend warriors, then I’ll have Yosemite to myself 🙂</p>\n\n<p>1538\n<br />Found a decent spot 🙂. Was aiming for Obsidian CG, right off 395 past Sonora Junction. Only a ~35 min ride from Walker. Made it up to the campground by 11, but was already almost full, no view, and gnarly rocky roads in and out. Overweight Karen did not like. But, on the way in I noticed a couple pull offs with great views of the mountains. Backtracked a bit and found one that’s just about perfect. Little close to the road, but about one car an hour so far today. And the openness and views are amaaaazing.</p>\n\n<p>After I setup camp, I ran down into Bridgeport for supplies and food. Had a super good burger at The Barn right downtown. And their fries were on the money.</p>\n\n<p>Made my way back to camp and caught a rain shower right as I was getting close. Pulled everything in the tent and gave Karen her tarp. Really really glad I brought the two person tent. Fits all my stuff easily with plenty of room for moving around.</p>\n\n<p>Now I’m kicking back and getting the rest day I’ve been putting off for the last two days. Could lay here for hours listening to the rain hit my tent and the birds chirping. I’m a happy camper.\n</p>",
		"created_at": "2018-05-27 15:25:16.09927",
		"updated_at": "2018-05-27 15:25:16.09927",
		"date": "2018-05-26"
	},
	{
		"id": 6,
		"title": "05/27/18",
		"body": "<p>0825\n<br />Little chilly last night. Dropped down close to freezing. Stayed decently warm though. No real troubles sleeping.</p>\n\n<p>Just made a little fire and drinking a big cup of coffee. Plan is to do Sonora Pass and try and find a campsite on the west end. Seems like there are a few options. Hopefully find something 😬</p>\n\n<p>After that, thinking about hitting Yosemite first thing Monday morning, or if I find a good campsite, wait it out a night and hit it Tuesday. Got some miles to make up after that though.</p>\n\n<p>1410\n<br />Found a place to camp. Tried looking at a couple campgrounds, but they were all absolutely packed and madhouses. So I wandered to a place I had saved from freecampsites.net, down some forest/gravel roads. A big group has the best spot, but I was able to squeeze in down the road a bit.</p>\n\n<p>Oh, and holy cow Sonora Pass is intense. Probably the most intense road I’ve ever ridden. It was a straight hour and a half of hairpins, elevation ascents/descents, huge cliffs, and epic views. Was going to stop and get a selfie with Karen, but all the good pull off spots were packed 😕. Gotta say, the KLR held its own up there. Hit almost 10k feet, with a 3k incline within about 5 miles. Definitely was the least powered bike I saw up there haha.</p>\n\n<p>Resting a bit, then jumping down to Sierra Village for supplies and something to eat. Hopefully jump on Tioga Pass tomorrow towards Yosemite 😁\n</p>",
		"created_at": "2018-05-28 04:01:44.866987",
		"updated_at": "2018-05-28 04:01:44.866987",
		"date": "2018-05-27"
	},
	{
		"id": 26,
		"title": "06/16/18",
		"body": "<p>1852\n<br />Made it to Nashville. Soooo much better than Memphis. Already got some hot chicken and a couple beers at the breweries. Happy camper.</p>\n\n<p>Ride in was awesome. Took 100 east pretty much the whole way, which was filled with big sweeping curves, small towns, and great views nonstop. Made the 250+ mile trek worth it. Much easier to ride when you have a view and no semis on your ass or wind pushing you over. Tennessee is alright by me.</p>\n\n<p>Spending an extra day here in Nashville. Going to explore a bit more tomorrow after I catch up on some sleep and energy. Think it’s been 4 days straight of 200+ mile days. But so so glad I got here. Good beer, good food, and decent people. Definitely avoiding the hustle and bustle tonight though. That king size bed is starting to sound pretty nice haha.</p>\n\n<p>Plan next is to wander into the forest and camp a couple days, until I get into Greenville for the weekend with family. Really looking forward to that. And I know Karen is too. Gonna get her oil changed, filter cleaned, chain cleaned, full wash. Bout needs it at this point. Was complaining a bit today coming up and down over the hills. She’ll be alright though.\n</p>",
		"created_at": "2018-06-17 00:03:05.517951",
		"updated_at": "2018-06-17 00:03:05.517951",
		"date": "2018-06-16"
	},
	{
		"id": 7,
		"title": "05/28/18",
		"body": "<p>0934\n<br />So, plan is to take off in a bit and try to find a site just west of Yosemite NP. Looks like there are a couple dispersed options. Then, I’ll take all day Tuesday to go explore the valley and all that. Do a real slow scenic ride. On Wednesday, I’ll take off first thing in the morning and get over Tioga Pass. Depending on fatigue, will either camp or Motel 6 it down in Mammoth Lakes area. Decent options for both, especially on a Wednesday.</p>\n\n<p>That’s the tentative plan at least 🙂. Figured I can’t miss Yosemite being this close to it. Who knows if I’ll ever be able to do it like this again.</p>\n\n<p>1504\n<br />Success! Found an awesome dispersed spot off Hardin Flat Rd, only about a mile from Yosemite Park entrance 😁. Decent shade and right next to Soldier Creek. Easy in and out from 120. Should be able to get into the park by 7 or 8 tomorrow.</p>\n\n<p>Coming up the west end of Tioga Pass was amaaazing. So many great incline twisties. Only got caught behind two slowpokes, but they let me pass pretty quickly. Doesn’t have the views like Sonora or the crazy intense hairpins (yet), but it was definitely my flavor. Excited to make the full run on Wednesday.</p>\n\n<p>Saw hundreds of cars coming west on the pass today. Doesn’t look like many people decided to take Tuesday off. Got stuck in a little traffic coming off 108 (Sonora), but was able to eventually find a back way to 120 (Tioga). Glad I stopped and looked for another route. Google wasn’t going to tell me about it 😐.</p>\n\n<p>Going to setup camp now and run up to the gas station to see what they have for supplies/food.\n</p>",
		"created_at": "2018-05-29 16:22:15.308837",
		"updated_at": "2018-05-29 16:22:15.308837",
		"date": "2018-05-28"
	},
	{
		"id": 8,
		"title": "05/29/18",
		"body": "<p>1618\n<br />Late first entry today. Been moving since 7. Got into Yosemite by about 830. Traffic wasn’t too bad at all.</p>\n\n<p>And holy shit. That place is better than the ten thousand photos I’ve seen of it. It feels like you’re in a prehistoric time or Bob Ross painting, minus the crazy four year olds screaming haha.</p>\n\n<p>Came through and stopped at Tunnel View. Wasn’t too crowded. Chatted it up with an older hippy guy who seemed to want a friend haha. Nice guy though. Said he’s ridden the Alps on a KX75 back in the day. And now he wanders around in his Honda Odyssey, going to blues festivals and national parks all year. Doesn’t sound too bad.</p>\n\n<p>When I got closer in to the lodge and everything, I was a bit overwhelmed with all the options. So I decided to run over to the Lower Falls area. Saw there were a couple easy to moderate hikes around there. Did the Lower Falls, which was more of a quick walk down a sidewalk haha. And then walked over to the Upper Falls trail and did that. Woo, that one was a bit harder haha. Could tell I was still a bit out of shape. Made it up to Columbia Rock and it was totally worth it. The view was absolutely breathtaking. Had a 270 degree view of the valley, from the falls side.</p>\n\n<p>After I made my way down, I laid in the middle meadows area for a bit, before going to the food court for a deserved burger. Was meh. Glad to get out of that place. Even on a Tuesday afternoon, it was still crawling with the worst kind of tourists. Loud, rude, and messy.</p>\n\n<p>Either way, I’m glad I made the trip. Couple days behind schedule, but meh. Just grabbed some gas (53mpg!) and water and beer, and heading back to camp to relax. Hitting Tioga Pass east in the morning, then heading south to Mammoth Lakes. Onward ✌🏻.\n</p>",
		"created_at": "2018-05-30 20:52:35.356897",
		"updated_at": "2018-05-30 20:52:35.356897",
		"date": "2018-05-29"
	},
	{
		"id": 9,
		"title": "05/30/18",
		"body": "<p>0838\n<br />Packing up and getting ready to head out. Should be a fun ride over Tioga. Get to see the valley one more time, then elevation climbs and twisties 😁.</p>\n\n<p>Think I’m about ready for a shower. Going to try Sheridan (?) Creek CG first, right south of Mammoth Lakes. If it’s so-so, I’ll grab a Motel 6 in town. Still deciding if I bee-line it for Nevada/Arizona tomorrow or hit King’s Canyon. Not sure if I can get in from the east though 😕. Will do some more research when I get service (hopefully) outside of the mountains.</p>\n\n<p>2033\n<br />Tired as hell. Ended up at a weird Motel 6 in Mammoth.</p>\n\n<p>Caught the first couple periods of the hockey game at a decent locals sports bar across the street. Burger was super good. Different shaped bun, spicy thousand island sauce, crispy lettuce.</p>\n\n<p>Waiting for my laundry to finish up, then passing out (with ear plugs). Going to grab a breakfast sandwich early, ship back my camera (phone works fine), then head towards the desert. Found a real weird kitschy alien-themed trailer motel in the middle of the desert that has openings. 240 miles away, but think I can make it without too much trouble if I leave by 8am, before the wind and heat picks up. Then maybe wander over to Area 51 haha. Should be an interesting day 🙂.</p>\n\n<p>Worst case scenario (wind/fatigue), there’s a decent sized town about 130 miles out that has multiple options. Not sure I’ll be camping much out in the desert. It’s already getting up to 110 degrees plus. I don’t know if Karen or I can handle that. Don’t need a heat stroke two weeks in.</p>\n\n<p>If I make it to weird alien land tomorrow, I should be on track for the Grand Canyon by this weekend. We’ll see how the crowds and heat are. Might have to make a one night run through there.</p>\n\n<p>Here’s to hoping the wind stays calm tomorrow morning. It’s my least favorite thing at this point 😔. But we’ll keep trucking along. Excited to see what this next week holds.</p>",
		"created_at": "2018-05-31 03:48:57.228758",
		"updated_at": "2018-05-31 03:48:57.228758",
		"date": "2018-05-30"
	},
	{
		"id": 10,
		"title": "05/31/18",
		"body": "<p>0746\n<br />Ugh. Wind is already gusting 30-40mph here in Mammoth Lakes, and there is a big wind advisory for the entire area I was supposed to ride today. Expected gusts 50mph+. Playing it safe and got another night here at Motel 6. Not stoked, but would rather be conservative. Supposed to drop down to barely any wind tomorrow morning.</p>\n\n<p>Guess I’ll wander around a bit today, and maybe work on my map site some more. Ugh.\n</p>",
		"created_at": "2018-06-01 14:37:31.703376",
		"updated_at": "2018-06-01 14:37:31.703376",
		"date": "2018-05-31"
	},
	{
		"id": 11,
		"title": "06/01/18",
		"body": "<p>0739\n<br />Packing up and heading out today. Due east from Mammoth Lakes into the desert, towards Tonopah, Nevada. Depending on wind fatigue, will with do an easy overnight camp outside Tonopah, or push through to the Rachel area. Excited to get back on the road 😁.</p>\n\n<p>1934\n<br />Made it about 30 miles east of Tonopah. Camping in the NF right next to some abandoned mines about a mile north of 6, off a dirt/sand road. Probably the only human for 10-20 miles each way. Pretty much the middle of nowhere haha. Wind and road were pretty brutal as I got into town. Came out here and setup camp, then ran back into town for food and supplies.</p>\n\n<p>Met a couple friendlies on the road today. Tons of Harley’s out. Was gorgeous coming over Benton Crossing, onto 120, then 95/6. Sweeping deserts backdropped with snow capped mountains, then immediately to miles of sagebrush and rolling hills and rock formations.</p>\n\n<p>Plan tomorrow is to get further east. Possibly Saint George, or a bit northwest of it at a campground. Trying to time things so I can snag a prime spot on the North Rim on Monday. Have 3-4 backups just in case. Want to spend at least a day or two out there.</p>\n\n<p>Excited for the stars tonight. Back to the road in the morning. Here’s to little wind and decent roads 🍻.\n</p>",
		"created_at": "2018-06-02 22:27:28.312693",
		"updated_at": "2018-06-02 22:27:28.312693",
		"date": "2018-06-01"
	},
	{
		"id": 12,
		"title": "06/02/18",
		"body": "<p>0943\n<br />Moving a little slow this morning. Breaking down camp now. Going to shoot for Caliente, bit northwest of St George. Wind isn’t too crazy today, so should be a decent ride. Might stop in Rachel for food at the weird alien-themed motel/restaurant.</p>\n\n<p>1806\n<br />Made my way to Caliente, at a state park just outside of town. Great setup and facilities. Nestled between sweeping rock formations with super clean bathrooms, cool pump water, and 25 cent showers! All for only $15/night and only 5 minutes from town. Super quiet, too. Only two RVs here besides myself on a Saturday night.</p>\n\n<p>Was a tiring ride today. Didn’t get out of camp until almost 11, as I struggled to get my panniers hooked up. Until I realized I had a bungee cord blocking the way (30 minutes later) 🤬. Did a hard 90 minute push to Rachel, Nevada for a quick break. A big biker party was already starting there, and I didn’t feel like hanging around and losing a day. Also my KLR probably doesn’t make enough noise for those guys haha. After that, ran down to Alamo for lunch. From there, cruised over here to Caliente. The wind wasn’t horrible, but wasn’t awesome either. Got whipped around a couple times by surprise north/south gusts, almost giving me whiplash. Can definitely tell I handle the wind much better when I’m not as fatigued. Didn’t help I got the early afternoon wind as well with the late start. Also they weren’t kidding when they said highway 6 was about the loneliest highway in America. Saw about 5 cars within a 100 mile run. Zero houses or towns. And about 5,000 cattle haha.</p>\n\n<p>Getting up early to run into town for breakfast and to call my mom. My sister, Jessica, is having her baby!!! Hoping to catch them on FaceTime. Will be thinking of her tonight 🙂. Then, might mingle over towards St George or further east to setup camp again before I get into the Grand Canyon on Monday/Tuesday. Woo!</p>",
		"created_at": "2018-06-03 15:13:17.103061",
		"updated_at": "2018-06-03 15:13:17.103061",
		"date": "2018-06-02"
	},
	{
		"id": 13,
		"title": "06/03/18",
		"body": "<p>0822\n<br />Things to remember: don’t get chicken from a truck stop in the middle of nowhere.</p>\n\n<p>New nephew was born at 10:41am eastern time! So excited. Waiting for pictures now.</p>\n\n<p>Camp was decent. Had some fiesta or something going on up at the day use area. Traffic running up and down the road until about 1030 at night. Other than that, no complaints. Was nice to actually have a decent flushing toilet this morning. Sure needed it.</p>\n\n<p>In town now, getting coffee and figuring out what’s next. Current plan is to pack up soon and head towards Snow Canyon SP, outside St George in Utah. Looks absolutely gorgeous and has decent amenities. Going to be a hot one though. Temps up in the high 90s 😓.</p>\n\n<p>From there, I’ll scoot towards Grand Canyon tomorrow. Hoping I’ll have enough stamina to make it out to the north rim overlook spot I’ve been eyeballing. If not, I’ll find something easier and get there on Tuesday.</p>\n\n<p>1713\n<br />Holy cow. This place, Snow Canyon, is amazing. Giant, dramatic lava flows and deep red sandstone cliffs. My mouth was agape as soon as I took the turn onto the state park road.</p>\n\n<p>Snagged a campsite tucked back against some of the sandstone cliffs. Not bad for $20, especially with it including free showers. Taking them up on that tonight. This 100 degree weather is not helping my already sweaty self.</p>\n\n<p>Fun ride today. About 15 miles outside of Caliente, Google Maps put me on a dirt/sand/gravel road for 40 miles! At first I was dreading it a bit, but after I realized I could hold 40mph easy, it turned into fun. Dodging giant rocks the size of my head, climbing quick 30% grade hills, and realizing I was about 15 miles from anyone each direction. The KLR ate it up. Was finally glad I put the 50/50 tires on. Been doubting those on every highway, but they paid off today. Gripped the hell out of that road.</p>\n\n<p>Once I got back on pavement, now in Utah, I stopped in town to get my bearings. And realized I’m in Mormon country on a Sunday haha. Gas stations were closed, roads empty, and a general sense of eeriness. Finally found a grocery market open outside of camp, where I helped myself to a pulled pork sandwich right out of the consumer-style slow cooker. Slammed it full and proceeded to scarf it down in less than 5 minutes. Not bad for a $5 sandwich.</p>\n\n<p>Going to do a 2-mile hike once the sun calms down and the wind comes out to play. The park ranger lady said it has the best view, and starts right outside the campground. Stoked for that.</p>\n\n<p>As far as tomorrow, not sure yet. Was thinking about either getting all the way to Jacob’s Lake, north of North Rim, and camping in the forest there. Or possibly see if I can snag a fancy campsite at Demotte, even closer. But, I’m also considering getting over to Zion NP and seeing if I can get anything there. I’m so damn close, and I’ll probably regret not stopping. We’ll see how the body feels in the morning. Think this shower at about 930 tonight will help 🙂.</p>\n\n<p>Oh, also, I broke 20k miles on the KLR! Bought it with 6.5k. Started the trip at 18,400. Almost up to 2k miles for the trip 😎.\n</p>",
		"created_at": "2018-06-04 02:46:43.847632",
		"updated_at": "2018-06-04 02:46:43.847632",
		"date": "2018-06-03"
	},
	{
		"id": 14,
		"title": "06/04/18",
		"body": "<p>0920\n<br />Tired today. Not quite sure what to do. Sounds like Zion is already packed full. And my spot in the Grand Canyon is 3+ hours away. Don’t think I’m quite up for that. Thinking I’ll target Jacob Lake, about 45 miles north of the north rim. Couple dispersed spots and a good sized campground there. Sounds like there is a gas station and food as well.</p>\n\n<p>Last night was meh. Everyone decided to show up at 9pm and make camp. Wish I would have grabbed one of the more remote sites. But I did sleep in a bit. This shade helped keep the sun out my tent.</p>\n\n<p>Supposed to get back up to triple digits today. After this giant cup of coffee, I’m going to get my ass in gear and hit the road. Don’t want to be making miles this afternoon when it’s real hot.</p>\n\n<p>1639\n<br />Still tired. Made it to Jacob Lake. Setup camp in the forest just outside “town”. At the restaurant now, about to eat their Grand Bill Sandwich. Which I guess is some crazy bull patty with green chili’s and a bunch of other stuff on it. We’ll see. Place seems kinda tourist trap-y. But nice to have supplies so close to camp. Hoping they sell whiskey in Arizona at the gas station 😜.</p>\n\n<p>Crazy wind again today. Got a late start and paid for it. 30-40mph gusts across open desert. Kept under or right at the speed limit all day.</p>\n\n<p>Plan is to hit the hay early, get up early, and get south towards the Grand Kahuna. Hike around there and explore all day. Hit the road on Wednesday. No idea what’s next 😬.</p>\n\n<p>Things to remember: the deep, burnt redness of the sandstone (aka petrified sand dunes, who knew) cliffs in Snow Canyon.\n</p>",
		"created_at": "2018-06-05 04:12:17.728653",
		"updated_at": "2018-06-05 04:12:17.728653",
		"date": "2018-06-04"
	},
	{
		"id": 15,
		"title": "06/05/18",
		"body": "<p>1309\n<br />Wow. This Grand Canyon thing is wow. The dramatic depth and overwhelming size is wild. Found a great 5 mile hike up to Cape Final. Only one out here. Well worth the hour drive in off the main road. Wouldn’t mind if the 30mph gusts calmed down though. My fear of heights and vertigo is kicking in haha.</p>\n\n<p>Going to hike back and get to camp. Need to figure out what’s next. No clue besides going east 😁.</p>\n\n<p>1910\n<br />Broke 2k miles! Karen is still kicking strong. Might get her a new rear tire, chain and sprockets here by Texas.</p>\n\n<p>Relaxing at camp now, drinking this mediocre IPA from Durango, CO. Shoulda got the Deschutes they had.</p>\n\n<p>Good day today. Bit windy all around, but only two or three oh shit gusts. Think I’m going to grab a motel in the reservation east of here tomorrow. Try and figure out the next week’s route. Lots of flat, hot road either direction. But without bucket list national parks in the immediate future, I should be able to make good miles.</p>\n\n<p>Grand Canyon was good. Honestly it’s so damn big it’s overwhelming and a bit underwhelming at the same time. Lack of contrast maybe? Don’t get me wrong, I’m super glad I made it here. But I’d take Yose over the Grand any day. I still get goosebumps thinking about that first descent into Yosemite Valley. Don’t think I’ll ever forget that feeling.</p>\n\n<p>Gonna grab a light breakfast and extra coffee in the morning and hit the road hard. Different feeling as I come across two weeks now. Starting to relax a bit more, I think. Either way, looking forward to pushing forward 🙂.\n</p>",
		"created_at": "2018-06-06 02:20:43.41781",
		"updated_at": "2018-06-06 02:20:43.41781",
		"date": "2018-06-05"
	},
	{
		"id": 16,
		"title": "06/06/18",
		"body": "<p>1959\n<br />Long day. Got camp packed up and on the road by 10. Lots of wind, rough highways, and semis. Ended up at a Motel 6 in Flagstaff. Had my first Freddy’s Steakburger. Damn it was good. Other than that, been relaxing and getting ready for tomorrow.</p>\n\n<p>Made my way through the Navajo Reservation a bit today. Some of the expansive views and dramatic cliffs were breathtaking. But man, it’s got some rough edges. Felt like a third world country at times. Kinda bummed me out.</p>\n\n<p>Plan is to hit the road by 6am, hopefully beating the wind. Get to Gallup, NM and crash in another $40 motel. Hoping to get east of Texas here fairly quickly. Not a ton of great camping options, especially with the heat already picking up (100+ everywhere).</p>",
		"created_at": "2018-06-07 03:14:12.734968",
		"updated_at": "2018-06-07 03:14:12.734968",
		"date": "2018-06-06"
	},
	{
		"id": 17,
		"title": "06/07/18",
		"body": "<p>1235\n<br />Beat the wind today! Got on the road by 645 and it was smooth sailing until about 10, when it started picking up. Ended up in Gallup, NM, at a cheap motel outside downtown. Easiest 200 mile day yet! Going to try and get up even earlier tomorrow to see if I can squeeze a 250 mile day in.</p>\n\n<p>Heading out in a few to grab some lunch and wander around town a bit. Feeling good today 😁.\n</p>",
		"created_at": "2018-06-08 12:37:42.907005",
		"updated_at": "2018-06-08 12:37:42.907005",
		"date": "2018-06-07"
	},
	{
		"id": 18,
		"title": "06/08/18",
		"body": "<p>1654\n<br />Made it to Albuquerque. Decent ride in. Google had me take some...</p>\n\n<p>1925\n<br />Man, this town is legit. Gonna stay through Saturday night now. Found 5 breweries within...</p>\n\n<p>2017\n<br />Good signs. I like this place.\n</p>",
		"created_at": "2018-06-09 19:43:50.207736",
		"updated_at": "2018-06-09 19:43:50.207736",
		"date": "2018-06-08"
	},
	{
		"id": 19,
		"title": "06/09/18",
		"body": "<p>1344\n<br />Decided to grab another night here in The Querque. Ended up doing my own brew crawl around downtown. Man, they have some good beer here. Think my favorite was the Monk’s Ale, had a couple of those 🙂. Favorite tap house is probably between Sidetrack and Boese Brothers. Decent beers too.</p>\n\n<p>Ended up with tacos from Sister Bar before it got too crazy. Central Ave was definitely starting to fill up. Grabbed one more Monk’s Ale (ok maybe two) and scooted back to the motel and proceeded to instantly pass out by 9.</p>\n\n<p>Got a good shower this morning and hiked over to Taqueria Mexican for a super good breakfast burrito. Then made my way to Marble Brewery for a beer and some good conversation. Now I’m back at Sidetrack getting some AC and an IPA in me.</p>\n\n<p>Probably kill an hour or two here. Build up an appetite for some more green chili stuff. And also maybe a nap 😴.</p>\n\n<p>Plan is to jet tomorrow to Clovis, right on the border of New Mexico and Texas, for a night. Onward!\n</p>",
		"created_at": "2018-06-10 00:12:19.180059",
		"updated_at": "2018-06-10 00:12:19.180059",
		"date": "2018-06-09"
	},
	{
		"id": 20,
		"title": "06/10/18",
		"body": "<p>1519\n<br />Made it to Clovis, NM. Pulled about 250 miles today. Got a little warm and hit some wind before town, but wasn’t too bad. Going to take it easy tonight and try to hit the road early tomorrow and get another 250. Found a classy $40 motel with good AC and TV 😁. The fires have squashed about any chance of camping out here. Figure I’ll just keep hustling east to get past this windy zone. Should calm down by Arkansas.</p>\n\n<p>Not much going on in Clovis. Definitely some rough edges. Had my fun in Albuquerque the last two days, so I don’t mind getting back on the grind east. Likely find another cheap motel in a small west Texas town tomorrow 👍🏻.</p>\n\n<p>1844\n<br />I stopped in Vaughn today, off highway 60, for a Red Bull and a snickers (great lunch). The lady who rang me up about made me cry. I asked her how she was doing, and she told me her recently passed husband used to always say “fiiiine...sure” (or something along those lines). She said she had forgotten all about the way he used to say that, until now. She said he left a lot of good, fun memories. You could tell she really misses him. It really got to me. Couldn’t stop thinking about the way she smiled when recalling her memories of him. Still can’t stop thinking about it. All the things in the world, all the places in the world, and the things you treasure most are the people you share those things and places with. Got hit with a little loneliness. Looking forward to getting to SC and Michigan to see family.\n</p>",
		"created_at": "2018-06-11 00:52:42.56479",
		"updated_at": "2018-06-11 00:52:42.56479",
		"date": "2018-06-10"
	},
	{
		"id": 21,
		"title": "06/11/18",
		"body": "<p>1136\n<br />Woo boy it’s windy out here in west Texas. Sitting at a Valero in Tulia, hoping it calms down a bit. Must be gusting 30-40mph, and the damn farm highways are 75mph speed limit. So semis are going 80, coming at me on a two lane highway. Thought it was going to throw me off the bike haha.</p>\n\n<p>If you don’t really need to stay in Clovis, NM, don’t. Shitty town. The train runs right in the middle of it, all hours of the night, blaring it’s horn. Food sucks. People are sketchy. Definitely not my favorite stop of the trip haha.</p>\n\n<p>Still heading towards Childress, for a cheap motel. Seems like a decent little town. Texas people are as advertised (most of them at least). Nice as hell. Even the truckers as they pass me going 65 in a 75, holding on for dear life haha. Only 180 miles planned today, but I figured the wind was gonna kick my ass. So I’m taking my sweet dandy time now. Hopefully be in town by 3ish.</p>\n\n<p>2112\n<br />Made it to Childress, Texas. Posted up at a motel off the highway. Decent enough. AC blows cold.</p>\n\n<p>Almost forgot Texas BBQ! Hiked over to K Bryant BBQ in downtown Childress for some brisket and pulled pork for dinner. Best damn brisket I’ve ever had. Was well worth the two mile hike in 100 degree heat.</p>\n\n<p>Lost another hour to time zones, but need to get my ass to sleep. Going to head for Ardmore, Oklahoma tomorrow. Try and find a new rear tire for Karen. There’s a decent sized dealer in town, which I’m hoping will have something that’ll fit and can install it same day. Hoping to not lose a day of miles just to get the rear installed. But no way I’m doing it in a parking lot with 100 degree heat and a half-ass jack haha. If they don’t have anything, I might have to weasel south to Dallas or north to OKC 😕. Wish me luck!</p>",
		"created_at": "2018-06-12 02:22:05.884208",
		"updated_at": "2018-06-12 02:22:05.884208",
		"date": "2018-06-11"
	},
	{
		"id": 22,
		"title": "06/12/18",
		"body": "<p>1109\n<br />Finally found a rear tire in Altus, Oklahoma. Called about 8 different places looking for one. Nice guys and shop though. They’re working on it now. Hoping to be back on the road by noon, heading for Ardmore. Looking forward to not stressing about that rear 🙂, especially as I get up in the mountains. Bit bummed all they had was the OEM, but it’ll work. And be better than the nicest bald tire.</p>\n\n<p>Still on track for Arkansas tomorrow, right on the border of Texas. Crossing fingers they don’t find anything else on the bike 😬.</p>\n\n<p>1500\n<br />Well, didn’t make it to Ardmore. Got about 1 mile down the south highway and turned around. The damn wind! Blowing constant 25mph, with gusts at least 35-40mph, and coming from the east. Had my bike almost fully leaned over. Popped a u-turn and kept heading east to Lawton, where I am now. Bit bummed I didn’t make it further today, but there was no way with that wind. Worst yet. Going to try and beat it in the morning tomorrow. Get as far east as I can haha.</p>\n\n<p>In better news, new rear tire is installed. And they tossed on new rear brake pads. They were about shot. Kid said I probably only had a couple hundred miles left on both the tire and brakes. Glad I noticed and decided to prioritize that today 😁. Chain and sprockets and everything else is looking good. Probably do an oil change once I get into SC and have some room and a couple days to get it squared away.</p>\n\n<p>Even though the new rear tire put me in the wind crosshairs, glad I got it done. Forecast is showing light wind in the morning, so will be getting to bed early tonight, after something quick for dinner. And maybe a beer for my troubles today 🙂.\n</p>",
		"created_at": "2018-06-12 20:10:00.315315",
		"updated_at": "2018-06-12 20:10:00.315315",
		"date": "2018-06-12"
	},
	{
		"id": 23,
		"title": "06/13/18",
		"body": "<p>1710\n<br />Made it to Broken Bow Lake, at Hochatown State Park. Holy cow what a day. Pulled 270+ miles over 6 hours. Longest day yet. But it was worth it. Found a site on a point at the lake, with my own personal shore. Water is warm, shade is just enough, and my body is finally relaxing.</p>\n\n<p>Met an old man at a gas station in a one gas station town today. Asked me if I was out for a cruise today, and told him I was coming from Oregon. He said, “that’s one helluva cruise!”. Said he had never been outside his small town, except when he went in the army some 50 years earlier. Told him to do it while he can. People don’t bite out there and there’s a lot of beautiful country just a couple highways away. He replied he’s “seen pictures”. Made me feel extra grateful I’m able to go and do this trip. I know I’ve spoken to and passed by so many people who have never been outside their county lines.</p>\n\n<p>Speaking of beautiful country, boy was I glad to get east of the plains a bit. Coming into southeastern Oklahoma was an explosion of green. Highways cut through thick, giant tree lines, with rolling hills and creeks galore. Excited to continue up into the forests and mountains, through Arkansas and into Tennessee and beyond. I don’t mind the desert, but I do love some good full trees, big lakes, and mountain ranges.</p>\n\n<p>Not sure what the plan is next. Might stay an extra day here, depending on how the body feels tomorrow. If not, then I’ll keep heading northeast a bit. Hopefully miss these storms that are coming into the south. Day by day 😎.\n</p>",
		"created_at": "2018-06-13 23:30:06.704947",
		"updated_at": "2018-06-13 23:30:06.704947",
		"date": "2018-06-13"
	},
	{
		"id": 24,
		"title": "06/14/18",
		"body": "<p>2010\n<br />Made it to Little Rock, Arkansas. Treated myself to a “fancy” hotel right outside of downtown. Not much for camping around here, and the cheap motels looked a little sketchy in town 😕.</p>\n\n<p>Felt the fatigue today. Didn’t get lower than 80 degrees last night, with a good amount of humidity. Started sweating as soon as I laid down to sleep haha. As you can imagine, didn’t get the best sleep. But got on the road by 9 and made my way east. Glad I took the long route up through the forest. Was a tiring but rewarding route. Lots of fun twisties, great views, and charming little towns.</p>\n\n<p>Took a full scrub shower at the hotel, then went into town for some beers and dinner at the local breweries. Didn’t last long though. Was way too tired. Ended up back at the hotel by 630 and have been relaxing, channel surfing since.</p>\n\n<p>Hoping a good night sleep in this king bed will get me back to full strength. Would like to be outside Memphis tomorrow, ready to get up to Nashville for a rest/exploration day. Heard good things from the locals. After that, I should be able to do a night of camping, then get down to Greenville, SC to see and stay with the family 😁.\n</p>",
		"created_at": "2018-06-15 01:23:58.340519",
		"updated_at": "2018-06-15 01:23:58.340519",
		"date": "2018-06-14"
	},
	{
		"id": 25,
		"title": "06/15/18",
		"body": "<p>1434\n<br />Made it to south Memphis, home of THE King and the one and only Graceland, haha. Found a somewhat cheap motel that’s not in too shady of a location. Was slim pickings for anything under $150 and not available by the hour (if you know what I mean).</p>\n\n<p>Pretty uneventful ride today. Slept good last night, but was feeling the fatigue from the last couple days. Don’t think this muggy weather helps at all. Was damn flat coming through Arkansas, into Mississippi, and up into Tennessee. Lots of farmland and straight, old rundown highways. Couldn’t believe some of the bumps they had on 65mph highways. Must have been 6+ inch speed bumps haha.</p>\n\n<p>Memphis sure looks rough. Don’t think I’ll be wandering around here tonight, especially with it being a Friday. Might hike down to get a glimpse of Graceland though here in a bit. Less than a mile away and I doubt I’ll be coming through here again anytime soon.\n</p>",
		"created_at": "2018-06-16 13:08:36.180898",
		"updated_at": "2018-06-16 13:08:36.180898",
		"date": "2018-06-15"
	},
	{
		"id": 27,
		"title": "06/17/18",
		"body": "<p>0950\n<br />I like Nashville. Ended up wandering around town after dinner. Found myself down Broadway, which was wild haha. So many people out. Didn’t feel like waiting in line anywhere, and kept walking. Heard some Pink Floyd playing real loud, like it was coming from an outdoor venue or something. And what do you know, it was a Pink Floyd Nashville Orchestra concert! Haha. Walked up and bought a lawn ticket, a $13 beer, and parked myself in a completely packed crowd. So rad. Made it there for an hour or two before I realized I needed bed. Found a Lyft, got back to my hotel, and immediately passed out.</p>\n\n<p>Slept in a bit, and now relaxing in the AC, watching the World Cup and US Open. Trying to decide if I want to go wander more and find lunch, or be super lazy and get some Cracker Barrel or Waffle House next door. Much needed rest day.\n</p>",
		"created_at": "2018-06-18 03:04:06.088115",
		"updated_at": "2018-06-18 03:04:06.088115",
		"date": "2018-06-17"
	},
	{
		"id": 28,
		"title": "06/18/18",
		"body": "<p>1927\n<br />Made it to east Knoxville for a quick motel night. Going to get up early and rally down to the Smokies! Setup camp for a couple days and wander around there. Looks like some awesome hiking and riding.</p>\n\n<p>Decent ride in today. Some beautiful scenery and limited traffic getting into town. Definitely felt a little off this morning though. Couldn’t tell if it was the rest day, antsy to get into the forest, or what. But it got better as I got further east.</p>\n\n<p>Grabbed a quick bite for dinner and now hanging out in the motel, waiting for this Beavers game to come back on. Damn thunderstorms in Omaha.\n</p>",
		"created_at": "2018-06-19 12:29:02.647768",
		"updated_at": "2018-06-19 12:29:02.647768",
		"date": "2018-06-18"
	},
	{
		"id": 29,
		"title": "06/19/18",
		"body": "<p>1129\n<br />Made it into the Smokies! Absolutely gorgeous out here. Found a nice quiet campsite at Cosby Campground. Might wander a little today around the trails, but saving energy for the big 15 mile hike tomorrow up to Mt Cammerer Lookout. Read you get 360 views up there with a view that rivals Mt LeConte. Heard the hike is just as hard though, if not harder. I’m going to take my time haha.</p>\n\n<p>Damn time zone change made me lose an hour, so didn’t get out until about 9. Great ride out here. Lots of twisties and hills with little traffic and great thick forests to run through. Don’t think I’m going to do the Tail of the Dragon or any of the other “famous” rides. Not feeling up to the traffic and crazies out there. And Karen is seriously due for an oil change. She wouldn’t be very happy haha. There’s plenty of other great riding out here.</p>\n\n<p>Going to head into town in a bit to grab supplies. Lots of great downed firewood here. Excited to finally have a fire, since I’m out of forest fire country. Possible thunderstorms and rain this afternoon and tomorrow, but lots of tree cover here. Not too worried. Going to get up to the lookout in the morning, before the rain comes through.</p>\n\n<p>So relaxing out here. There’s a softness and a lushness in these forests you don’t find in Oregon. Almost has a sweet scent to it, too. Looking forward to hitting the trails tomorrow. Hoping the skeeters leave me alone haha.</p>\n\n<p>1854\n<br />Just realized it’s my one month anniversary on the road! Have to say, I’m pretty happy with my strategies and setup so far. Zero miles of interstate, not one minute of riding in the dark, and not one thing I wish I had out here with me. Couple things I can probably send back now since it’s not getting any cooler than 70 out haha.</p>\n\n<p>Bike has been holding up great. Not a hill it hasn’t been able to climb with ease. Couple gravel roads I probably would have avoided haha, but I survived. Not super happy with my new rear tire (OEM) I got in Altus, but it’s working. Can tell she’s ready for an oil change though. Feeling a bit rougher than usual (it’s a single thumper haha). Looking forward to getting that done at my Aunt’s here this week. Gotta say, the KLR is a decent cross country bike, if you stay off the interstates haha. With everyone, including semis, going 85+ on some, it doesn’t look fun. Karen likes to cruise right about 60-65 😎.</p>\n\n<p>Just did the Hen Wallows Falls hike here out of Cosby CG. 5 miles out and back. Pretty decent. Feeling confident about the 15 miler tomorrow.</p>\n\n<p>Campground filled up a bit, which is kinda annoying. But no crazy kids running around or loud generators, so I got that going for me. And there’s a decent bathroom for the morning, which I’m also not complaining about haha.</p>\n\n<p>Should be a good day tomorrow. Never figured I’d like hiking as much as I do. Something regenerative and peaceful about just walking. Weird, I know haha.</p>\n\n<p>Things to remember: lightning bugs, sweet smell of East Tennessee forest, maybe avoid Cosby CG in the future haha\n</p>",
		"created_at": "2018-06-20 18:29:34.817526",
		"updated_at": "2018-06-20 18:29:34.817526",
		"date": "2018-06-19"
	},
	{
		"id": 30,
		"title": "06/21/18",
		"body": "<p>0831\n<br />Decent night sleep. Storm held off. Taking my time this morning. Feeling sore after yesterday. Back is holding up well, but my legs are shot. All that climbing took it out of me.</p>\n\n<p>Going to start breaking down camp here shortly and hit the road. Hoping I don’t hit too much rain getting south 😬.</p>\n\n<p>2252\n<br />Made it to my Aunt Jodie and Uncle Jonni’s house in Tigerville, SC, just outside Greenville. So glad to be here and see some familiar faces and places. Not to mention the wonderful hosts my aunt and uncle are.</p>\n\n<p>Awesome, challenging ride in today. Lots of backcountry twisties through East Tennessee, up into North Carolina, and then back down into South Carolina. Beautiful scenery and tough roads.</p>\n\n<p>Helped an older lady put some air in her tires at a small gas station just before North Carolina. Was from Illinois and was going to visit her brother and mother. Reminded me of my Nana. Sweet as can be. She said she doesn’t understand why the heck anyone would want to live out here though. Been rained on the last 4 days straight haha. Tried turning down the $5 she handed me, but I’ve learned you can only resist so much with nice ladies like that.</p>\n\n<p>Getting some much needed rest in this comfy bed tonight. Going into town tomorrow to get some bike stuff and supplies for Karen and I, along with getting the oil changed in Gammy’s car. Might squeeze a haircut in there too. This buzz cut is starting to turn into something weird haha.\n</p>",
		"created_at": "2018-06-22 03:07:13.496903",
		"updated_at": "2018-06-22 03:07:13.496903",
		"date": "2018-06-21"
	},
	{
		"id": 63,
		"title": "06/24/18",
		"body": "<p>1918\n<br />I’m slacking on the journal! Been at my aunt and uncle’s here outside of Greenville the last couple days, relaxing, visiting with family, and eating way too much haha.</p>\n\n<p>On Friday I went into town and found some oil, a filter, fresh chain lube, and camping supplies. Then met up with my Uncle Jonni for lunch at this awesome taco place in Greenville. Chased three giant tacos down with a local IPA and made my way back to the house to work on the bike.</p>\n\n<p>Started getting the oil changed on the bike, as I’ve done multiple times before, and got to reinstalling the oil filter cover. Tiny 8mm fastener bolts hold the cover in place for the o-ring inside. Installed the first fine, then snapped the second 🤬. Right off at the recessed part. Tried getting an edge to turn it, with no luck.</p>\n\n<p>With it such a small bolt in such a delicate area, I had zero confidence in tapping it out myself. Not without potentially ruining the threads or worse, penetrating the case cover itself. So, started looking for a professional to look at it. Not much to find on a Friday evening, so I wrapped everything up and tried to get some sleep.</p>\n\n<p>Next morning, my cousin Cary helped find a local guy who does custom bikes. Took it over to him and within 5 minutes he knew it wasn’t going to be an easy out option. He would want to get the whole case cover off and get it up on a drill press to make sure nothing else gets screwed up. And he was booked two weeks out. But, he said as long as the seal is strong (which it is), I should be fine.</p>\n\n<p>Felt a little better getting another opinion that it should be alright. For peace of mind, decided to get some RTV (sealant) to help keep that oil in there. Before starting on all of that, I went and hit a round of golf with my cousins and spent a relaxing night watching the Beavs get to the CWS finals! Much needed stress reliever.</p>\n\n<p>Today, my uncle ran me around to the hardware stores to track down RTV, new M6 bolts for my skid plate, and new hosing I found needed replacing. Got everything installed, chain lubed, and we’re ready to go. Will be keeping a very close eye on that filter cover and my oil levels to make sure nothing is sneaking out. Feeling confident it’ll be alright.</p>\n\n<p>It’s been so great to get back to family for a bit. My aunt and uncle have spoiled me with a fridge full of beer, homemade meals, and great company. Looking forward to getting back down here.</p>\n\n<p>Next big stop is Portland, Maine! Going to start heading that direction tomorrow morning, hoping to get there by the 2nd or 3rd of July. Should have plenty of time to stick to the backroads and be able to wander a little bit. Excited to see the ocean and be with friends for the 4th 😁. Onward!\n</p>",
		"created_at": "2018-06-24 23:39:30.078035",
		"updated_at": "2018-06-24 23:39:30.078035",
		"date": "2018-06-24"
	},
	{
		"id": 64,
		"title": "06/25/18",
		"body": "<p>1732\n<br />Made it to Martinsville, Virginia. Nice ride today. Lots of back roads and twisties coming up through west NC and south VA. Bike is holding up well after my patch job this weekend. Running much better with that fresh oil as well. And I’m really glad I missed the storm coming into the mountains west of here 😁.</p>\n\n<p>Going to find somewhere to watch the Beavers and grab some food. Will get good rest tonight and hit the road early. Likely in another motel tomorrow night with the weather looking quite iffy. Hoping to camp this week somewhere 😬.\n</p>",
		"created_at": "2018-06-26 11:15:25.203212",
		"updated_at": "2018-06-26 11:15:25.203212",
		"date": "2018-06-25"
	},
	{
		"id": 65,
		"title": "06/26/18",
		"body": "<p>1926\n<br />Great ride today! Made it up through Shenandoah National Park on Skyline Drive, landing in Luray, Virginia. Beautiful scenery and challenging twisties throughout. Tons of overlooks to catch a view, and good amenities inside the park. And I saw a black bear finally! Haha. He/she was not more than 10 feet off the road chowing down on some greens. Saw my bike and ran back into the woods.</p>\n\n<p>Rain found me this morning after I got out of Martinsville. Occasional showers and lots of drizzle for the first hour or two. Wasn’t too bad. Felt a little refreshing after sweating my butt off these last couple weeks. Helped there wasn’t much of any traffic.</p>\n\n<p>Watching the Beavers and drinking a beer in my cheap motel now. Think I’m going to get up to Harrisburg, Pennsylvania tomorrow. Shorter/easier ride than these last two days, good prices on motels, and a couple museums I might check out. Have been making good miles since SC. Should have plenty of time to get up to Portland, Maine by July 4th. Excited!\n</p>",
		"created_at": "2018-06-27 12:48:02.649712",
		"updated_at": "2018-06-27 12:48:02.649712",
		"date": "2018-06-26"
	},
	{
		"id": 66,
		"title": "06/27/18",
		"body": "<p>2025\n<br />Challenging ride today! Rain/wet roads, loose gravel, crazy narrow backroads, and full on gravel. But thankfully managed to miss any heavy rain.</p>\n\n<p>In Harrisburg, Pennsylvania now at a motel. Had me a nap, dinner at the sports bar up the road (stromboli was good), and now relaxing in my room. Hoping these Beavers can stay alive and force a game 3. Tough start so far.</p>\n\n<p>Trying to figure out where to go next. Not much good camping until you get up north further, and I need to start heading east a bit towards the coast. Going to do more research tonight and see if I can find some woods and water to camp at. Starting to get tired of all this pavement and traffic. Good news is I’m still ahead of schedule for Portland, Maine 🙂.\n</p>",
		"created_at": "2018-06-28 12:05:29.796125",
		"updated_at": "2018-06-28 12:05:29.796125",
		"date": "2018-06-27"
	},
	{
		"id": 67,
		"title": "06/30/18",
		"body": "<p>0844\n<br />Long ride yesterday. Made it about 6hrs on the bike, for a full 8hr travel day. Wore me out, but super fun. Lots of twisties and challenging roads coming up through the Delaware Water Gap and mountains. Or at least what they call mountains, haha.</p>\n\n<p>Landed at a small old motel called Catskill Motor Court, just west of Catskill, NY. Decent enough people and setup. Think I’ll do an easy ride northeast up into New Hampshire/Vermont area today. Wiggle my way towards Portland.</p>\n\n<p>Drivers up here are a tad different than the south. A lot more impatient and crazy haha. Been keeping my distance and my head on a swivel, especially on these tight two lane highways with hidden pullouts everywhere. They’ve definitely packed things in much more up here. And you can tell the roads have been around much longer. Real narrow. Not designed for giant SUVs or diesel trucks.\n</p>",
		"created_at": "2018-07-01 12:39:22.532128",
		"updated_at": "2018-07-01 12:39:22.532128",
		"date": "2018-06-30"
	},
	{
		"id": 68,
		"title": "07/01/18",
		"body": "<p>1322\n<br />Having a lazy Sunday in Brattleboro, Vermont. Getting up to 100 degrees and this AC feels too good. Also the cheapest motel around, with decent food within walking distance.</p>\n\n<p>Fun, easy ride yesterday through the Green Mountain and Finger Lakes forest. Vermont reminds me a bit of Oregon. Lots of Subarus, people on bicycles, and outdoorsy folks. Brattleboro isn’t the most charming of towns, but it’s not too bad. After an early dinner last night I ended up at the bowling alley next door. Bowled 4 games and had the place to myself haha. Ended up back at the bar and chatted up the locals until close. Good company.</p>\n\n<p>Think I’ll get out towards the coast tomorrow for a night before I head up to Portland. Found a couple cheaper Airbnbs outside of Portsmouth that look decent. Hoping the traffic and tourists aren’t too crazy 😬.\n</p>",
		"created_at": "2018-07-02 12:55:59.309816",
		"updated_at": "2018-07-02 12:55:59.309816",
		"date": "2018-07-01"
	},
	{
		"id": 69,
		"title": "07/02/18",
		"body": "<p>1114\n<br />On my way to Wells, Maine, a little beach town just south of Portland. Found an affordable Airbnb right next to the beach. Slowly making my way over there, as checkin isn’t until 4pm 🙄. Hoping to stumble upon some good lunch somewhere.</p>\n\n<p>Also New Hampshire’s license plate motto is badass and I love it: “Live free or die”. So American and appropriate for the holiday coming up, haha.</p>\n\n<p>2015\n<br />Made it to Wells, Maine. Found a great Airbnb right off highway 1. Had some decent NY style pizza for dinner, and now relaxing in my room with some decent local Maine IPAs.</p>\n\n<p>Bikers don’t wave up here! First place I’ve been that people don’t do the obligatory wave/something to each other. They also don’t wear helmets up here, so maybe that has something to do with it. Or they’re all on Harley’s and my 650 ADV isn’t “cool” enough, haha. Only if they knew I rode this oversized dirt bike 6,000 miles across the country 🙂.</p>\n\n<p>I like it out here so far. Mixed vibes of Boston, Vermont, and coasties. Lots of heavy accents. But oh boy, I had a hot lobster roll at Maine Diner and it might have been my best meal so far. I’ve eaten some decent seafood out in Oregon, but haven’t had anything close to this lobster. Worth every dollar. And was lucky enough to sit right away, being a solo and all. My counter neighbor asked me how the roll was and I told her it was my first one, but damn good. Said I was from Oregon, and they pronounced Oryyygun better than anyone yet, haha.</p>\n\n<p>Can’t say I don’t mind this slow pace up through New England. Looks like I’ll be spending about another week or so wandering up through Maine and into Canada next 😁.\n</p>",
		"created_at": "2018-07-03 00:26:24.865615",
		"updated_at": "2018-07-03 00:26:24.865615",
		"date": "2018-07-02"
	},
	{
		"id": 70,
		"title": "07/06/18",
		"body": "<p>0846\n<br />Slacking again! For good reason though 😁. Got into Portland, Maine on the 3rd and explored a ton with my friend Rose. Took a ferry to Peaks Island, did an all day river float with a bunch of great people, enjoyed lots of good food and beer, and caught the fireworks show on the Eastern Prom.</p>\n\n<p>Great vibes in Portland. Stayed at my friends place and received wonderful hospitality all around. Only bad thing is my dumb self got sunburnt to a crisp on the river float 😔. Been paying for it the last two days. Bunked up in a motel now, up in Brunswick, trying to get it into a manageable state. Somewhat fortunately, it’s also supposed to rain most of the day, so I don’t feel as bad taking today off.</p>\n\n<p>Still not quite sure what’s next. Hoping to see some friends up in Bangor this weekend, but also want to get some camping in over by Acadia National Park. Guess I’ll have some time today to figure all that out 🙂.</p>\n\n<p>Things to remember: Dave Arnold hot lobster roll from Maine Diner, mid-summer sunset from Peaks Island, never ever forget sunscreen in the car again\n</p>",
		"created_at": "2018-07-07 14:51:51.921724",
		"updated_at": "2018-07-07 14:51:51.921724",
		"date": "2018-07-06"
	},
	{
		"id": 71,
		"title": "07/08/18",
		"body": "<p>1912\n<br />Still in Maine! Have to say, bit of a fan so far. Stayed with some friends up in Bangor last night (bestest people) and am now on the coast just outside Milbridge. Awesome little town-run campsite headed by an amazing guy named Dennis. So friendly and accommodating. I want to be his best friend haha.</p>\n\n<p>Drank more Maine beer and ate more lobster yesterday. Not tired of it yet! Beautiful rides the last couple days coming up the coast and zig zagging inland. Caught some wonderful weather as well. 75 and sunny with a light breeze and no humidity. Can’t ask for better 😁.</p>\n\n<p>Making the jaunt to Acadia National Park tomorrow for a decent hike and general wandering. Didn’t know it even existed until I got up here, but everyone ever has been raving about it. Excited to get it on a Monday after a holiday week. Will head back to camp here in Milbridge after.</p>\n\n<p>We’ll see what’s next. Possibly northern Vermont, then Canada. Or get to the most eastern American point and then directly into Canada 🙂. Day by day!\n</p>",
		"created_at": "2018-07-08 23:22:04.079084",
		"updated_at": "2018-07-08 23:22:04.079084",
		"date": "2018-07-08"
	},
	{
		"id": 72,
		"title": "07/09/18",
		"body": "<p>1744\n<br />So so good. Hiked up to Dorr Mountain in Acadia National Park today. My first ladders hike (only a couple) and I loved it. Straight up descent with tons of rock scrambling, low traffic, and great views. Took the long way back down and ran into a few couples/groups, sweating and looking exhausted (I was too haha), asking me how much further. I always lied and told them the summit is closer than it was. That way they don’t give up 🙂 (unless they’re completely out of their element and don’t look prepared).</p>\n\n<p>Stopped at Atlantic Brewing on my way out and had possibly my favorite BBQ wings of all time. Paired em with a great double Czech. Thank you Marijo and Chris for the recommendations!</p>\n\n<p>Made it back to camp with a six pack of decent local blonde beer and strong dose of satisfied fatigue. Ran into the camp hosts and chatted for a bit. Literally the nicest and best people I may have ever met, haha. I’m most definitely coming back. Going to see if there’s some national camp host award or something I can nominate them for.</p>\n\n<p>Not sure what tomorrow holds. My epic sunburn has decided to blister 😫, so thinking a quick-ish motel tomorrow might be wise. Then hoping to head into northern Vermont for camping and breweries. Going to miss Maine 😔. But I will absolutely be back. Just only in the summer haha.</p>\n\n<p>Things to remember: sunscreen, sunscreen, sunscreen, don’t go to Bar Harbor ever again, Dennis and Tera at McClellan Park</p>\n\n<p>PS: happy birthday momma!\n</p>",
		"created_at": "2018-07-09 22:02:13.311834",
		"updated_at": "2018-07-09 22:02:13.311834",
		"date": "2018-07-09"
	},
	{
		"id": 73,
		"title": "07/10/18",
		"body": "<p>2225\n<br />Made it to Gorham, New Hampshire. Not without a little challenge along the way. About halfway through the 230 mile ride, I pulled over for a quick rest and realized my kickstand was not quite working anymore. On a fully loaded bike, that’s not very good news, haha. Realized the bolt that holds the kickstand onto the bike had popped loose. And could not get it rethreaded whatsoever. Ugh.</p>\n\n<p>Hustled to check-in at my motel here in Gorham, then ran up to Walmart to get an adjustable wrench, since that bolt was the one size I don’t have a socket for 😔. With the bike leaned up against a shopping cart return gate in the middle of the parking lot, I was able to get the bolt out and the kickstand off. Quickly realized the kickstand itself was bent to hell where the bolt mounts it to the bike. Super ugh. This thing is pretty heavy duty and wasn’t going to bend back (and in the right direction) without a decent amount of force and/or heat. So I packed it up and headed back to the motel. Leaned Karen up against a fence and added some bungee cords for good measure.</p>\n\n<p>Going to try a couple shops in town tomorrow morning to see if anyone will help me get it straight. Two or three within walking distance. Crossing my fingers. The part is $80 new and will take a week to get shipped. Couple used ones on eBay, but about the same cost and shipping time. Will figure out something. No way I’m riding all the way home without a kickstand, haha. Only so many trees and buildings to lean it against.</p>\n\n<p>Not sure what’s after Gorham. Need to get this kickstand fixed and off my mind before I decide what direction is next. 🤞\n</p>",
		"created_at": "2018-07-11 02:42:20.372675",
		"updated_at": "2018-07-11 02:42:20.372675",
		"date": "2018-07-10"
	},
	{
		"id": 74,
		"title": "07/11/18",
		"body": "<p>2134\n<br />Great vibes here in Vermont. Took an easy, scenic route into Stowe. Perfect weather, no traffic, and great views non-stop. Landed at a small inn right in the middle of town. Caught the end of the World Cup game at the pizza place next door, then wandered around to a couple breweries and tap rooms. Oh and fit a burger in between from a local spot that was super good.</p>\n\n<p>Chatted with the inn keeper a bit after I got back. Had some great stories about riding around here and traveling with his wife abroad. Makes me want to get on a plane soon and jump the pond.</p>\n\n<p>Oh ya, fixed my kickstand today! Walked across the street this morning to A&amp;A Auto Shop with my kickstand in hand and every ounce of charm I could muster. They got a torch on it and had it bent back straight within 10 minutes. Wrestled it back on the bike and was good to go. Couldn’t have been happier to get that figured out. Was stressing me out a bit last night. As the motel owner said when I told him it was fixed, “there are still some good people out there”.</p>\n\n<p>Think I’m going to head north across the border tomorrow into Canadaland. Found a cheap but decent Airbnb located right in the middle of Montreal. Planning to get it for two nights. Then I’ll start heading west again towards the Great Lakes. Should be fun. Looking forward to having a full day to explore the city. Haven’t had one of those in a while. ✌🏻</p>",
		"created_at": "2018-07-12 01:45:22.639039",
		"updated_at": "2018-07-12 01:45:22.639039",
		"date": "2018-07-11"
	},
	{
		"id": 75,
		"title": "07/12/18",
		"body": "<p>1931\n<br />They let me into Canada! Haha. They were a little suspicious of my unemployment. Asked me how much money I had in my bank account! But alas, the gates opened and I continued north, into Montreal. Was quite the adventure getting to my Airbnb downtown. The bridge my directions told me to take was closed. So I had to navigate around a ton of construction to another bridge and wiggle my way through downtown. Made it though!</p>\n\n<p>Wonderful ride today. Northern Vermont is breathtaking. Randomly made my way through Smuggler’s Notch, which was something else. 25%+ grades and crazy hairpins that turned into a barely single car width lane. Might have taken it a bit faster than you’re supposed to 😬. But holy cow you should have seen the smile on my face. One of the perks of not researching too much on the route ahead.</p>\n\n<p>Montreal is amazing. Definitely a larger city, but with it being full on French (80%+ only speak French 😫) and the most diverse place I’ve ever been (by far), I’m a fan. Feels like a different country, and not just because it’s Canada. All signs, menus, etc. are all in French. I had no idea, haha. Awesome surprise though.</p>\n\n<p>Wandering around to a few pubs now, chatting up strangers and doing some great people watching. Have all day tomorrow to explore more. Thinking art museum, somewhere hip for lunch, then an early dinner to avoid the Friday rush. Nooo clue what’s next. Going to pull out the laptop tomorrow and hopefully figure out how to navigate the camping situation up here. Wish me luck! ✌🏻\n</p>",
		"created_at": "2018-07-13 03:31:35.265605",
		"updated_at": "2018-07-13 03:31:35.265605",
		"date": "2018-07-12"
	},
	{
		"id": 76,
		"title": "07/13/18",
		"body": "<p>0856\n<br />There’s something about being in the heart of a diverse and bustling city that I love. So much energy and movement. Feels very comfortable.</p>\n\n<p>Made it out until about midnight last night. Went back to the Irish pub for some great live music and a couple pints of Guinness. Then trekked over to Dunn’s for an obligatory late night smoked meat sandwich. So so good.</p>\n\n<p>Slept decently well in my little twin bed. Downing this coffee, then getting a shower and heading towards the art museum. Figure I’ll wander around there for a couple hours, then go find some poutine and/or a bagel for lunch. Need to figure out my next move at some point today. Enjoying the city first though 🙂.\n</p>",
		"created_at": "2018-07-14 13:26:56.224684",
		"updated_at": "2018-07-14 13:26:56.224684",
		"date": "2018-07-13"
	},
	{
		"id": 77,
		"title": "07/15/18",
		"body": "<p>2111\n<br />Well, yesterday may have been the hardest day yet. And all my own doing. Left Montreal at about 11am, after staying out later than I was planning. Got about 2hrs west and realized I forgot my passport! I had hidden it a bit, just in case, and completely forgotten it. Texted my Airbnb host and turned around to jump on the freeway. Struggled through Saturday traffic back downtown, but got it back! Only problem was my 5hr ride was turning into an 8hr ride 😔.</p>\n\n<p>Made it into Shawville, Ontario, and immediately realized I picked the wrong cheap motel. When I checked in, their machine was “down” and had to pay them in USD and CAD, because that’s all I had. Told me my room was the last available and was due for “renovations”. They could have used a stronger word. No blanket, carpet was at least 40 years old, TV didn’t work, no AC, and there was mold all along the baseboards. Don’t think the bathroom had been used in at least a year. But it decided to start pouring rain and thundering, so I had to suck it up. Sweated all night, for about 6hrs of sleep. Left as soon as I woke up.</p>\n\n<p>North Bay is much better! Got into downtown and found a sports bar just as the second half of the World Cup final was starting. Lots of French fans, good wings, and decent vibes all around. After the game, I was able to check in early at my motel right outside of downtown. They just remodeled and oh man, it’s like staying in the Ritz after last night.</p>\n\n<p>After a long shower and quick nap, I walked down to a pub for some local beers, a great chopped steak burger, and lively conversation with some canucks. Hung around there for a couple hours, and now back at the motel. Figure I’ll sleep pretty good tonight versus last night 🙂.</p>\n\n<p>Starting to crave some nature time, so going to wander down to Killarney Provincial Park to see if I can snag a campsite. Their website says it’s all booked, but it’ll be a Monday and they have some first come first serves. Thinking I’ll stay there a couple nights and get some hiking in. And hopefully be able to rent a canoe or kayak to wander around the lake 😁.\n</p>",
		"created_at": "2018-07-16 01:26:38.423051",
		"updated_at": "2018-07-16 01:26:38.423051",
		"date": "2018-07-15"
	},
	{
		"id": 78,
		"title": "07/18/18",
		"body": "<p>0902\n<br />Slacking on the journal again 😬. Currently in Killarney Provincial Park, just south of Sudbury, Ontario. Beautiful park, but the campground is fairly full of family campers (including crying babies). And the mosquitos at my site are pretty gnarly, especially in the afternoon. Not to mention they charge about $30/night for basic tent camping 🙄.</p>\n\n<p>Did a super fun 5 mile hike yesterday on The Crack Trail, about 4 miles east of the campground. Started out flat and uninteresting, but quickly turned into challenging rock scrambles and straight up ascents. Had a blast. And the view up top was breathtaking. Glad I got there early-ish in the morning though. On my way back down I passed at least a dozen groups making their way up. And the parking lot was completely full.</p>\n\n<p>Came back to camp after the hike and relaxed for a bit. Then jumped on the bike and headed into town for the so-called “world famous” fish and chips. They were pretty good. Not quite sure they were $18 good, but with it literally being the only place serving food within 60 miles, I can’t complain too much. Wandered around town for a bit, mostly to avoid the mosquitos back at camp.</p>\n\n<p>The OEM rear tire I had put on in Oklahoma is already almost worn out 😔. Not very surprised, but still annoyed. Should have enough tread left to get to my sister’s outside Lansing, Michigan, where I have a new one waiting. Was hoping I’d make it back to Oregon before shelling out another $150 for a new rear and install. Other than that, the bike has been running strong. Will climb any hill and run through any giant pothole without complaining. Which there are plenty of up here in snow country. Thought the roads were rough in Arizona and Mississippi, but I think Maine and Ontario are now leading the pack on worst condition public roads.</p>\n\n<p>Heading west of Sudbury today to find a cheap-ish motel to get a shower and recharge batteries. And hide from the mosquitos for a night, haha. Still deciding whether I stay an extra day or two in Ontario, or get across the border sooner than later. We’ll see 🙂.\n</p>",
		"created_at": "2018-07-19 03:18:19.918954",
		"updated_at": "2018-07-19 03:18:19.918954",
		"date": "2018-07-18"
	},
	{
		"id": 79,
		"title": "07/20/18",
		"body": "<p>1951\n<br />Made it back to the states! Enjoyed my time up north, but glad to be back stateside. No real troubles crossing the border. The agent was definitely curious what the hell I was doing on my bike so far from Oregon, haha.</p>\n\n<p>Awesome ride coming into Michigan. Well besides the Mackinac bridge. Construction forced one lane closed and required you to drive on a gnarly grated section that had my 21 inch skinny front tire diving left and right all over the place. Held on for dear life and made it through.</p>\n\n<p>Stayed the night in Gaylord, Michigan, a Bavarian-style resort town that had some character. Found a great BBQ place with craft beers down the street from my motel. Ate a huge brisket sandwich and wandered to the dive bar down the street to see what the locals were up to.</p>\n\n<p>Took off this morning around 10 and started heading south towards my sister’s place outside Lansing. Made it about 25 miles until the wind picked up like crazy. Almost blown off the road twice and decided to pull over and evaluate things. Couldn’t find another route outside the wind and I was going to find thunderstorms further south, in addition to the wind. Saw a motel about 100 yards away and decided to call it for the day. Wind is supposed to be dead tomorrow. Going to hit the road early and hopefully avoid too many rain showers.</p>\n\n<p>Bit of a bummer to lose a day, but I just did not feel comfortable fighting those 30mph+ winds for another 3.5hrs. Especially if the rain was going to hit. But will make it tomorrow! Excited to stay a couple days with my sister, brother in law, and nephews 😁.\n</p>",
		"created_at": "2018-07-21 03:40:34.298083",
		"updated_at": "2018-07-21 03:40:34.298083",
		"date": "2018-07-20"
	},
	{
		"id": 80,
		"title": "07/28/18",
		"body": "<p>2124\n<br />Apologies for the major slacking this last week! Good excuse though. Been hanging out with my nephews, sister, and brother-in-law in Sunfield, Michigan. Also had to do a bit of work on Karen to get ready for this next run into Wyoming and Montana. That turned into quite the adventure itself.</p>\n\n<p>By the time I got to my sister’s, my chain was about to fall off and my rear tire was about to the threads. Thought they’d have to come pick me up 15 miles outside of town, haha. Ordered up a new chain and sprockets, which would take a couple days to arrive. But kept busy and had tons of fun with my 3 year old nephew Joey, and meeting my 2 month old nephew Jaytin.</p>\n\n<p>When I went to take off the old rear sprocket I managed to strip the hell out of two of the nuts 😔. Took me about two days, four hardware stores, six new tools (recently donated to my brother-in-law), three bruised knuckles, and a couple swear words to finally get them off. Extremely thankful for the support from my sister and my brother-in-law. If I was in a Walmart parking lot I would have given up a long time ago and pushed it to a shop somewhere, haha.</p>\n\n<p>Bike is all back together and running better than ever. New rear tire, new chain and sprockets, fresh brake fluid, and a little bit cleaner than before. Excited to get back on the road. Going to miss this crew though. They’ve been so awesome and I’ll always cherish the time I’ve gotten to spend with my sister and nephews here. Can’t wait for them to move out west again 🙂.</p>\n\n<p>Heading up to Ludington, Michigan tomorrow to catch a ferry across Lake Michigan! Takeoff at 8:45pm for a 4 hour ride across the lake. Should be fun. Will likely grab a motel right in Manitowoc, Wisconsin after I get off the boat. Then heading west into Wisconsin for hopefully some decent camping and exploring 😎.</p>\n\n<p>Will make sure to keep up on the entries going forward ✌🏻.\n</p>",
		"created_at": "2018-07-29 03:02:04.266604",
		"updated_at": "2018-07-29 03:02:04.266604",
		"date": "2018-07-28"
	},
	{
		"id": 81,
		"title": "07/29/18",
		"body": "<p>2256\n<br />On a boat! SS Badger ferry going across Lake Michigan, from Ludington, Michigan to Manitowoc, Wisconsin. 4hr ride, docking at around midnight central time. Decent boat ride. Caught the sunset and great weather coming out of Ludington. Only motorcycle on the ferry, but was super easy to get it loaded and strapped down. Food and drink not crazily priced, which is nice.</p>\n\n<p>Have a motel booked in Manitowoc for the night. Only 2 miles west of the docks, so should be easy to get over there in the dark. First time riding in the dark the whole trip! Figured it was worth it. Otherwise I would have had to run down around Chicago and fight traffic and construction and boringness.</p>\n\n<p>Made two adjustments to my ride that already seem game-changing. First, I bought a pair of low profile wireless earbuds to listen to music in my helmet. Not a huge fan of the idea, as I figured it would be more distracting than anything else. But with all the open plains riding I have coming, I needed something. And it’s been great today. More relaxing than anything. Keeps my mind from focusing on how far I’ve gone and how much further I have. We’ll see how it holds up over the next couple days.</p>\n\n<p>The other big change was long overdue. Moved my backpack off my back and onto my rear rack. Little more wind drag and height behind me, but the freedom of movement and lack of constant shoulder/back pressure already seems like a huge improvement.</p>\n\n<p>Still deciding on what’s next. Debating on whether to head to Devil’s Lake outside Madison, Wisconsin for a couple days of camping or get further west and do a quick motel. I’ll decide in the morning 🙂.</p>",
		"created_at": "2018-07-30 13:48:59.886879",
		"updated_at": "2018-07-30 13:48:59.886879",
		"date": "2018-07-29"
	},
	{
		"id": 82,
		"title": "07/31/18",
		"body": "<p>2151\n<br />Decided on Devil’s Lake State Park, couple hours north of Madison, Wisconsin. Was able to grab a decent campsite yesterday afternoon. Staying here two nights, then back on the road.</p>\n\n<p>Didn’t realize how busy this park would be 😔. Even on a Monday/Tuesday, the parking lots have been full all day, and most campsites filled. But I was able to get out for a hike this morning without too much traffic. Fun hike. 4.5 miles with two decent climbs and descents. Decided to start running a bit and had way more fun. Super tough scrambling up/down slick rock steps and through loose pine needles/dirt with traffic. Need to do more of that.</p>\n\n<p>Turning 30 tomorrow! Been spending a bit of the day reflecting on my 20s. Crazy how much has happened and how far I’ve come since 20, living in my parent’s farm house with about $20 in my bank account, kicked out of college, no job, no clue what to do next. Makes me feel extremely grateful for the luck and support I’ve received over the last 10 years. And to be at a point to where I can do this trip, the way I want to, with the support of friends and family on the way, is more than I could have ever imagined as a 20 year old lost in the ocean of life.</p>\n\n<p>Things to remember: slow down, the ecstasy of love and the hell of loss and every contour in between, every human can learn and change and grow, family first\n</p>",
		"created_at": "2018-08-01 03:12:23.01481",
		"updated_at": "2018-08-01 03:12:23.01481",
		"date": "2018-07-31"
	},
	{
		"id": 83,
		"title": "08/03/18",
		"body": "<p>0821\n<br />Well, still in La Crosse, Wisconsin. Wasn’t feeling too hot yesterday, so decided to stay another day at the motel. Bit disappointed though, as there’s a good storm coming in tomorrow through the area and I was hoping to be west of it by now.</p>\n\n<p>Been researching the weather all morning and think I’m going to scoot up north a bit, to Eau Claire to wait out the storm. High winds west of me, and it looks like almost an inch of rain all day tomorrow with more wind. Supposed to clear up on Sunday and be clear, easy riding west all next week.</p>\n\n<p>Not super excited to lose another day of riding, but probably better to play it safe and not get caught in 30mph winds and thunderstorms. Should be able to get to Wyoming by mid next week if the forecast holds up 🤞.\n</p>",
		"created_at": "2018-08-04 00:03:32.152311",
		"updated_at": "2018-08-04 00:03:32.152311",
		"date": "2018-08-03"
	},
	{
		"id": 84,
		"title": "08/05/18",
		"body": "<p>2102\n<br />Made it to Marshall, Minnesota for a cheap motel night. Uneventful 5hr ride today. Lots of corn fields, long straight highways, and one gas station towns. Felt a little off, but glad I covered 250 miles. Think I might be fighting the start of a cold, so grabbed some meds to take before bed.</p>\n\n<p>Plan to be in Pierre, South Dakota tomorrow. Should be a little under 5hrs and about 230 miles. Hoping this medicine and a good night sleep help my headache. If I keep up this pace, I should be close to Yellowstone by this weekend. Haven’t done a ton of research on where I’ll be staying, but I’ll figure it out 🙂.\n</p>",
		"created_at": "2018-08-06 02:08:48.109931",
		"updated_at": "2018-08-06 02:08:48.109931",
		"date": "2018-08-05"
	},
	{
		"id": 85,
		"title": "08/06/18",
		"body": "<p>2127\n<br />In Pierre, South Dakota. Bit of a rough motel, but cheapest in town and recently remodeled. Will do.</p>\n\n<p>Another 250 mile day. Felt better this morning, but could feel the fatigue towards the end. Bike had a couple struggles when I accelerated hard. Ran through everything and noticed the chain was a bit tight. Then realized when I installed the new one, I didn’t tension it with it fully loaded up 🤦‍♂️. So called around and found a Harley dealership that could adjust it for me. Shipped back my portable jack in Michigan, so no way to get the rear wheel off the ground. They had it done in 15 minutes, as soon as I got into town. Hoping that fixes it.</p>\n\n<p>Excited for tomorrow. Found a super awesome (hopefully) free campsite right outside Badlands National Park. Tons of great reviews and right outside the entrance of the park and close to town. Figure I’ll stay there for two nights to catch up on some rest before I push on to the Tetons. Also just excited to get past all these corn fields and long flat highways 😁.\n</p>",
		"created_at": "2018-08-07 02:43:04.217685",
		"updated_at": "2018-08-07 02:43:04.217685",
		"date": "2018-08-06"
	},
	{
		"id": 86,
		"title": "08/09/18",
		"body": "<p>2124\n<br />Rapid City, South Dakota for the night at a motel. Think there’s more motorcycles parked in the parking lot than rooms. Right outside of Sturgis, home of one of the largest biker rallies in the world. 99% of them fit the classic “biker on a Harley” style. Leather vest and chaps, bandana, no helmet, goatee/beard, and possibly a woman riding on the back who you would not want to cross. But I’ve also seen every shape and size and age of biker out there. Nice ladies in their 60s, young guys with full face helmets, gloves, and other smart safety gear. They’re also a lot friendlier than they look. I’ve received a decent amount of waves on the road, and some warm gas station conversations. Especially when they notice I’m literally the only one out here on a 650cc single-cylinder dual sport bike, haha. I’ve seen probably 1,000 bikes the last couple days, but not one other KLR! Can count on one hand the number of adventure BMWs. But I didn’t mind.</p>\n\n<p>Camped the last two nights in the Badlands Wilderness, just outside Badlands National Park and a small charming town called Wall, South Dakota. The campsite I found was amaaazing. 10mins from town, 5mins from the National Park, private 270 degree view looking down into a canyon with dramatic cliffs, rolling hills, and vast plains. And it was free! Had a couple neighbors and a few late arrivals try and sneak in my area, but everyone was super nice and it was extremely quiet. Yesterday I sat in my chair and read a book for about 7 hours straight, completely melted in the view (and also the sun with no shade, haha). Highly highly recommend the Badlands.</p>\n\n<p>Today I rolled through the park at a leisurely pace and made my way up to Rapid City. Easy ride, but I knew I needed to figure out how to get my oil changed, especially before getting up into the mountains. Have been feeling the symptoms grow this last week.</p>\n\n<p>Was a bit of an adventure tracking down the specific oil I needed and then figuring out how I was going to drain and dispose of the old oil. Thankfully Walmart had a perfect match and exactly the number of quarts I needed (3). Then was able to find an O’Reilly’s that would let me use a loaner oil pan and then recycle the oil for me. Had the oil changed in about 15 minutes in the O’Reilly’s parking lot. Nothing broke or went wrong this time, too! Haha.</p>\n\n<p>Getting back on the road tomorrow morning, headed to Casper, Wyoming. Seems like a neat little town, has cheap motels, and is on my route to the Tetons. If all goes well, I should be in western Wyoming by Sunday evening. No clue what my plan will be for the Tetons, Yellowstone, and all that. Hoping for good camping and good weather, but will need to get some research done in the next couple days. So many things to see and do! Karen and I will figure it out as we go. Been working pretty well so far 😎.\n</p>",
		"created_at": "2018-08-10 04:03:18.733213",
		"updated_at": "2018-08-10 04:03:18.733213",
		"date": "2018-08-09"
	},
	{
		"id": 87,
		"title": "08/10/18",
		"body": "<p>2101\n<br />Some days I wake up and absolutely dread lifting my leg over on that damn thumper and fighting the wind for 5hrs on long lonely roads. Today wasn’t one of those days. I had a grin on my face for the first two hours, riding through the Black Hills in perfect weather and beautiful scenery. I didn’t want it to stop. But it did. There’s a lot of gorgeous country in the big US of A, but also a lot of boring country.</p>\n\n<p>After the fun was over, I finished the 250 mile day on dusty, straight highways with 70mph speed limits and passing semis. Survive and advance. Ended up in Casper, Wyoming, staying at the cheapest motel in town, getting ready to make my way closer to those Grand Tetons. Found an old school fast food joint in town and ate some of the best chicken strips and fries I’ve ever had. Back at the motel now having a Friday night party reading my Stephen King book and watching triple D’s on the Food channel. Don’t think I’d quite fit in at the local dive bars here 😬.</p>\n\n<p>Taking it a bit easy tomorrow, seeing as I’ll have a bit more boring stuff before I get to the fun stuff up in the mountains. Likely end up at a motel in central Wyoming for the night, then scoot towards Jackson/Teton on Sunday morning. ✌️</p>",
		"created_at": "2018-08-11 03:16:39.350335",
		"updated_at": "2018-08-11 03:16:39.350335",
		"date": "2018-08-10"
	},
	{
		"id": 88,
		"title": "08/12/18",
		"body": "<p>2129\n<br />Landed in Riverton, Wyoming. Was completely wiped yesterday after a 2hr ride from Casper through the windy and hot high plains. Decided to grab an extra night here and rest up. Also needed to give Karen some love. She started rough and I felt a loss of power multiple times on the ride out. And then I realized I hadn’t cleaned my air filter since leaving Oregon 🤦‍♂️.</p>\n\n<p>The process of cleaning my air filter in my motel room almost looked like a Breaking Bad episode, haha. Borrowed garbage can, dish soap, motor oil, gallon size plastic bags, half roll of paper towels, and a bathtub. Got it done without making too much of a mess. Fired up the bike and could immediately hear and feel the difference. Woo. Should get me back to Oregon in one piece.</p>\n\n<p>Tomorrow I’ll be heading towards the Tetons for some camping. Have three different options, ranging from a partially developed campground with water and pit toilets, to way up on the edge of a canyon in heavy grizzly country. Hoping the Monday morning arrival will give me decent options. Excited to check out Jackson and get some hiking in.</p>\n\n<p>Also, I’ve decided to skip Yellowstone and Glacier this trip 😕. Really want to be back home by August 25th (nephew’s 5th birthday!), and I’m running out of time. And after more research, I realized coming into Yellowstone from the south makes lodging/camping options tough. Anything close to the park is either super expensive or fully booked up. Not too bummed though. Figuring I won’t be sad to skip the crowds and traffic. And I don’t want to stress/rush through western Montana and up through Glacier. Will save that part of the country for the next trip 🙂.\n</p>",
		"created_at": "2018-08-13 03:50:56.7054",
		"updated_at": "2018-08-13 03:50:56.7054",
		"date": "2018-08-12"
	},
	{
		"id": 121,
		"title": "08/14/18",
		"body": "<p>1952\n<br />Made it to the Tetons! Found a site at Curtis Canyon, just outside of Jackson, Wyoming. Little rough getting up here, but was able to snag a great spot. Super quiet and everyone friendly. Only bummer is the forest fires smoke is messing up the view 😔. But it ain’t too bad.</p>\n\n<p>Today I hiked around the canyon a bit, wandered in to town for lunch (which was a madhouse), then came back up top to catch the sunset. Was surprised to find about a dozen paragliders either in the air or about to take off. Was fun watching them fly around in front of the mountains.</p>\n\n<p>After two nights here, I’ll be taking off tomorrow to head west back to Oregon. As much as I’ve enjoyed being out on the road and seeing so much, I’m excited to get back home to see family and friends. And give Karen and I a much needed rest. Will be a bit grueling getting through SE Oregon, but will be nice to see familiar places. ✌️\n</p>",
		"created_at": "2018-08-15 02:22:25.039644",
		"updated_at": "2018-08-15 02:22:25.039644",
		"date": "2018-08-14"
	},
	{
		"id": 122,
		"title": "08/18/18",
		"body": "<p>2028\n<br />In Burns, Oregon tonight at a motel. Been a long couple days getting from the Tetons over here. Decent amount of wind, 100 degree desert heat, and lots of long straight highways. But I’m on the homestretch and should be back home by Monday.</p>\n\n<p>After the Tetons, I landed in Arco, Idaho. Odd town. They were the first city in the world to be completely powered by atomic energy (for a day) back in the 50s. Largest city in the county with less than 1,000 people. Not much out there, except for the giant secret Idaho National Laboratory. Gave me the creeps.</p>\n\n<p>Escaped Arco and got into Nampa, Idaho, neighbor city to Boise. Wasn’t too bad. Found a good pub with decent craft beers and a tasty slice of pizza next door. Was beat up pretty good and stayed an extra night there.</p>\n\n<p>On my way to Burns I stopped in New Plymouth, Idaho and visited with my great uncle, Ron and his daughter. Hadn’t seen them in years. Glad I stopped by. After that visit, it was supposed to be an easy 3hr ride to Burns. But it was hot as hell and the wind was kicking pretty good through the canyons. Gorgeous scenery. Would have liked to enjoy it a bit more.</p>\n\n<p>Taking off for one more stop in Madras tomorrow before heading home. Could probably push on, but my back and neck is killing me and I’m sure I’ll find more wind out that way. Looking forward to not riding my bike for at least two or three days 😁.\n</p>",
		"created_at": "2018-08-19 03:41:06.823624",
		"updated_at": "2018-08-19 03:41:06.823624",
		"date": "2018-08-18"
	}
]